trade_exp/src/DataProcessors/ПечатьЭтикетокИЦенников/ПечатьЭтикетокИЦенников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПечатьЭтикетокИЦенников</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВидЦеныДополнительно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПравилоОбмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РежимПолученияЦен</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаДополнительно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТиповоеСоглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ШаблонЭтикетки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ШаблонЦенника</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоВДокументе</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОстатокНаСкладе</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Весовой</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЦенаДополнительно</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоЦенников</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоЭтикеток</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="2bcb13a5-ad79-4c3d-b94e-d59d381eb43c">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

trade_exp/src/Catalogs/СкладскиеЯчейки/СкладскиеЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СкладскиеЯчейки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <owners>Checked</owners>
  </extension>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Склады</owners>
  <attributes>
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="066e30f6-7b05-4707-b88c-048e47e0ee62">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>39</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f3e5dfce-ce94-489f-bbc6-ba1b699e6a56">
    <name>ИспользованиеПериодичностиИнвентаризацииЯчейки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b7afe322-1954-42ee-b9f7-20803df9f4db">
    <name>КоличествоДнейМеждуИнвентаризациями</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="942b70ab-8729-495e-aa2e-e362fab7ecfd">
    <name>ТипСкладскойЯчейки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c08d78e7-8199-4896-a9fc-9ac0cb946bff">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="60091b4d-b59a-402b-8b0a-8f53fca6515a">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c4e170cc-c732-4607-8975-9c5a1ff87d55">
    <name>Линия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a5ca5828-4e29-461b-885b-7139ab2b8f0d">
    <name>Стеллаж</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="56a97705-349f-4913-8e45-02a642ba3195">
    <name>ПорядокОбхода</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ea064545-91fd-46da-987c-a068e1b5f13f">
    <name>Ярус</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc923ed7-93a9-4ab2-80bf-95d378dac70c">
    <name>Позиция</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="82b6a5ac-4bdb-4046-b405-1382915a4c74">
    <name>УровеньДоступности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b4a34412-3576-4048-b17b-40befc421c3f">
    <name>Типоразмер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="61217d52-e955-4b33-bc99-11d43aa1c1d9">
    <name>ОбластьХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63793c84-fe0a-46a7-b089-23086db66ef4">
    <name>МаксимальныйКоэффициентНаполненностиПоОбъему</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="45830319-bd9f-49d6-afc3-425511de0559">
    <name>МаксимальныйКоэффициентНаполненностиПоВесу</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/DataProcessors/ПечатьЭтикетокИЦенников/Forms/ФормаСкладскиеЯчейки/Module.bsl
&НаСервере
Процедура Док_ЗаполнитьПослеНаСервере()
	  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкладскиеЯчейки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
		|ГДЕ
		|	СкладскиеЯчейки.ПометкаУдаления = ЛОЖЬ";
	
	Если ЗначениеЗаполнено(_Группа) Тогда
		Запрос.Текст = Запрос.Текст + "
		|   И СкладскиеЯчейки.Родитель В ИЕРАРХИИ (&Родитель)";
		Запрос.УстановитьПараметр("Родитель", _Группа);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(_Секция) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И СкладскиеЯчейки.РабочийУчасток = &РабочийУчасток";
		Запрос.УстановитьПараметр("РабочийУчасток", _Секция);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Объект.СкладскиеЯчейки.Очистить();
	
	Пока РезультатЗапроса.Следующий() Цикл
		НоваяСтрока = Объект.СкладскиеЯчейки.Добавить();
		НоваяСтрока.Ячейка = РезультатЗапроса.Ссылка;
		НоваяСтрока.Штрихкод = ЧисловойКодПоСсылке(РезультатЗапроса.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ЗаполнитьПосле(Команда)
	Док_ЗаполнитьПослеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокПринтеровНаКлиенте()
	
	Элементы.Принтер.СписокВыбора.Добавить("Принтер по умолчанию", "Принтер по умолчанию");
	Принтеры = Новый COMОбъект("WScript.Network"); 
	Prn = Принтеры.EnumPrinterConnections(); 
	КоличествоПринтеров = Prn.Count() - 1;
	Для Счетчик = 1 По КоличествоПринтеров Цикл
		Элементы.Принтер.СписокВыбора.Добавить(Prn.Item(Счетчик), Prn.Item(Счетчик));
		Счетчик = Счетчик + 1; // потому что имена идут парами: resource name + printer name
	КонецЦикла; 
	
КонецПроцедуры


&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	ЗаполнитьСписокПринтеровНаКлиенте();
КонецПроцедуры


&НаСервере
&ИзменениеИКонтроль("ПолучитьПараметрыДляСкладскихЯчеек")
Функция Док_ПолучитьПараметрыДляСкладскихЯчеек()

	СкладскиеЯчейки = Объект.СкладскиеЯчейки.Выгрузить();

	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("СкладскиеЯчейки",        ПоместитьВоВременноеХранилище(СкладскиеЯчейки, УникальныйИдентификатор));
	ПараметрыПечати.Вставить("ШаблонЭтикетки",         Объект.ШаблонЭтикетки);
	ПараметрыПечати.Вставить("КоличествоЭкземпляров",  Объект.КоличествоЭкземпляров);
	ПараметрыПечати.Вставить("СтруктураМакетаШаблона", Неопределено);   
	#Вставка   
	ПараметрыПечати.Вставить("ПринтерИмя", Принтер);
	#КонецВставки

	Возврат ПараметрыПечати;

КонецФункции
